Catalogs/СМ_ЧериЭксид_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СМ_ЧериЭксид_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючАПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДилера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЭксид</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Производители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРемонта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыРемонта</Name>
			<Comment>Виды авторемонта</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРемонта</Name>
					<Comment>Типы ремонта (платный/бесплатный)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСебестоимость</Name>
					<Comment>Распределить на себестоимость автомобиля</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходаДетали</Name>
					<Comment>Статья расхода деталей</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходаДетали</Name>
					<Comment>Статья дохода деталей</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходаРаботы</Name>
					<Comment>Статья дохода работ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехОбслуживание</Name>
					<Comment>Признак техобслуживание</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыработкаСотрудниковПоВыполнениюЗаказНаряда</Name>
					<Comment>Выработка сотрудников по выполнению заказ наряда</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДСРаботы</Name>
					<Comment>Работы без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Товары без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияЗавода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерческий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПроактивномКонтакте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьВремяРаботыСДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаМастеромПриемщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьВСтатусеВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЗЧИРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатильщикПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноЗаполнятьКомментарийВЗН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SendWA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСуммыВЗН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDR_ЛКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьУведомления</Name>
					<Comment>Признак отправки уведомлений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПриЗаписиНаРемонт</Name>
					<Comment>Шаблон, по которому будет формироватся сообщение при записи на ремонт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПриОтменеЗаявки</Name>
					<Comment>Шаблон, по которому будет формироватся сообщение отмене заявки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаОтправки</Name>
					<Comment>Начало промежутка времени, в которое необходимо отправлять смс</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияОтправки</Name>
					<Comment>Конец промежутка времени, в которое необходимо отправлять смс</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЗаВремя</Name>
					<Comment>Количество часов, за которое необходимо отправлять смс сообщение.   </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапчастиПоСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гарантия</Name>
					<Comment>Гарантийные плательщики</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Гарантийный плательщик</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетов</Name>
							<Comment>Договор взаиморасчетов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокРемонта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
					<Comment>Работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Comment>Авторабота</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СостояниеЗаказНаряда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМ_ЧЕРИ/Ext/Module.bsl
//Бондаренко++ 20231014
Функция ПолучитьСписокВидовРемонта(ТекОбъект) Экспорт
	
	ИтСпВидовРемонта = Новый СписокЗначений;
	
	ИтСпВидовРемонта.ЗагрузитьЗначения(ТекОбъект.ВидыРемонта.Выгрузить().ВыгрузитьКолонку("ВидРемонта"));
	
	Возврат ИтСпВидовРемонта;
 	
КонецФункции // ПолучитьСписокВидовРемонта(ТекОбъект)

//Бондаренко++ 20241005
Функция НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки(Марка,ПодразделениеКомпании) Экспорт
	
	Ссылка_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Ссылка КАК Ссылка,
		|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Марка КАК Марка,
		|	СМ_ЧериЭксид_НастройкиПодразделения.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ИЗ
		|	Справочник.СМ_ЧериЭксид_Настройки.Подразделения КАК СМ_ЧериЭксид_НастройкиПодразделения
		|ГДЕ
		|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Марка = &Марка
		|	И СМ_ЧериЭксид_НастройкиПодразделения.ПодразделениеКомпании = &ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Марка", Марка);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка_ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Ссылка_;
	
КонецФункции // НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки()
//Бондаренко-- 20241005

Процедура ИнтерактивнаяПроверкаСВыгрузкойУниверсальная(Ссылка) Экспорт
	Если Ссылка <> Неопределено Тогда
		Если ТипЗНЧ(Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			ЭлСпрНастроек = Неопределено;
			//Бондаренко++ 20241005
			//Попытка
			//	ЭлСпрНастроек = Справочники.СМ_ЧериЭксид_Настройки.НайтиПоРеквизиту("Марка",Ссылка.Автомобиль.Модель.Марка);
			//Исключение
			//КонецПопытки;
			Попытка
				ЭлСпрНастроек = НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки(Ссылка.Автомобиль.Модель.Марка,Ссылка.ПодразделениеКомпании);
			Исключение
			КонецПопытки;
			//Бондаренко-- 20241005
			
			//Бондаренко-- 20250521
			//Если ЭлСпрНастроек <> Неопределено Тогда
			Если ЭлСпрНастроек <> "" Тогда	
			//Бондаренко-- 20250521	
				
				Если Ссылка.Организация = ЭлСпрНастроек.Дилер Тогда
					Если Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
 						СписокВидовРемонта = Новый СписокЗначений;
  						Если ЭлСпрНастроек.ВидыРемонта.Количество() > 0 Тогда
							СписокВидовРемонта = ПолучитьСписокВидовРемонта(ЭлСпрНастроек);
						КонецЕсли;
						Если СписокВидовРемонта.НайтиПоЗначению(Ссылка.ВидРемонта) <> Неопределено Тогда
 							Если Ссылка.Пробег > 0 Тогда
								СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоМарке(Ссылка);					                                            
								СМГ_Сообщить("Завершена отправка на портал. Проверьте результат.",СтатусСообщения.Информация);
							Иначе
								СМГ_Сообщить("Пробег в документе '"+СокрЛП(Ссылка.Пробег)+"' не соответствует критериям выгрузки на портал. Должен быть больше нуля.",СтатусСообщения.ОченьВажное);							 		
							КонецЕсли;
 						Иначе	
							СМГ_Сообщить("Вид ремонта документа '"+СокрЛП(Ссылка.ВидРемонта)+"' не соответствует критериям выгрузки на портал.",СтатусСообщения.ОченьВажное);							 	 
							СМГ_Сообщить("Должен быть из списка: "+СписокВидовРемонта,СтатусСообщения.ОченьВажное);							 	
						КонецЕсли;
					Иначе
						СМГ_Сообщить("Состояние документа '"+СокрЛП(Ссылка.Состояние)+"' не соответствует критериям выгрузки на портал. Должно быть 'Выполнен' или 'Закрыт'",СтатусСообщения.ОченьВажное);							 
					КонецЕсли;	
 				Иначе
					СМГ_Сообщить("Организация документа '"+СокрЛП(Ссылка.Организация)+"' не соответствует критериям выгрузки на портал. Должна быть '"+СокрЛП(ЭлСпрНастроек.Дилер)+"'.",СтатусСообщения.ОченьВажное);						
				КонецЕсли;	
			КонецЕсли;				
 		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры             
//Бондаренко++ 20231014

Процедура ИнтерактивнаяПроверкаСВыгрузкой(Ссылка) Экспорт
	
	//Бондаренко++ 20231011
	Если Ссылка.Дата >= Дата(2023,10,17) Тогда
 		ИнтерактивнаяПроверкаСВыгрузкойУниверсальная(Ссылка);
		Возврат;		
	КонецЕсли;             
	//Бондаренко-- 20231011
 	
	//Бондаренко++ 20230617 
	//Если Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282") ИЛИ Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167106118") Тогда
	Если Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282") ИЛИ Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167106118") ИЛИ Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167104657") Тогда		
	//Бондаренко-- 20230617 	
		Если Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			Если Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ         
				//Бондаренко++ 20220606
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное ИЛИ
				//Бондаренко-- 20220606 
				//Бондаренко++ 20230607
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_нольПлатный ИЛИ
				//Бондаренко-- 20230607				
				//Бондаренко++ 20230706
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ
				//Бондаренко-- 20230706				
 				//Бондаренко++ 20230503
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании ИЛИ
				//Бондаренко-- 20230503 
 				//Бондаренко++ 20230714
				( Ссылка.ВидРемонта = Справочники.ВидыРемонта.ПредпродажнаяПодготовка И Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.EXEED ) ИЛИ
				//Бондаренко-- 20230714 
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.КоммерческийРемонт      ИЛИ 
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя   Тогда
				Если Ссылка.Пробег > 0 Тогда
					//Бондаренко++ 2023
 					Если Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.CHERY Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоЧери(Ссылка);					                                            
					//Бондаренко++ 20230601	
					ИначеЕсли Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.EXEED Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоЭксид(Ссылка);					                                            						
					ИначеЕсли Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.OMODA Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоОмода(Ссылка);					   
					//Бондаренко++ 20231006						
					ИначеЕсли Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.JAECOO Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоДжаеку(Ссылка);	 				
					//Бондаренко-- 20231006							
					КонецЕсли;					
					//Бондаренко-- 20230601					
 					Сообщить("Завершена попытка выгрузки на портал...",СтатусСообщения.Информация);
				Иначе
					Сообщить("Пробег в документе '"+СокрЛП(Ссылка.Пробег)+"' не соответствует критериям выгрузки на портал. Должен быть больше нуля.",СтатусСообщения.ОченьВажное);							 		
				КонецЕсли;
			Иначе
				Сообщить("Вид ремонта документа '"+СокрЛП(Ссылка.ВидРемонта)+"' не соответствует критериям выгрузки на портал.",СтатусСообщения.ОченьВажное);							 	 
				Сообщить("Должен быть: 'Техническое обслуживание','Техническое обслуживание (бесплатное)','ТO-0(платный)','ТО-0(Бесплатный)','Добрая воля компании','Коммерческий ремонт' или 'Гарантия производителя'",СтатусСообщения.ОченьВажное);							 	
			КонецЕсли;	                                                   
		Иначе
			Сообщить("Состояние документа '"+СокрЛП(Ссылка.Состояние)+"' не соответствует критериям выгрузки на портал. Должно быть 'Выполнен' или 'Закрыт'",СтатусСообщения.ОченьВажное);							 
		КонецЕсли;		
	Иначе
		Сообщить("Организация документа '"+СокрЛП(Ссылка.Организация)+"' не соответствует критериям выгрузки на портал. Должна быть 'Престиж Моторс ООО' или 'Автопарк ООО' или 'Атлант Моторс ООО'",СтатусСообщения.ОченьВажное);						
	КонецЕсли;	
	
	
КонецПроцедуры // ИнтерактивнаяПроверкаСВыгрузкой(Ссылка)
